Tekla Open API Reference for Tekla Structures 2025
PluginAttribute Properties
The PluginAttribute type exposes the following members.
Properties
Name | Description
Name
 The name of the plug-in in the system.
Top
See Also
Reference
PluginAttribute Class
Tekla.Structures.Plugins Namespace